In [4]:
import random as rd
import numpy as np
import pandas as pd

In [7]:
s = pd.Series(np.arange(3), ['a','b','c'])

In [12]:
s[0:2]

a    0
b    1
dtype: int64

In [13]:
sr =  pd.Series(np.arange(10))

In [14]:
sr

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [15]:
sr2 = sr[4:]

In [16]:
sr2

4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [18]:
sr2[4]

4

In [20]:
sr2.loc[4]

4

In [21]:
sr2.iloc[0]

4

In [9]:
pd.read_csv('../demo.csv')

   a  b  c
0  1  2  3
1  4  5  6

In [10]:
df = _9

In [11]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [12]:
df.to_csv('../test.csv')

In [34]:
df2 = pd.read_csv('../test.csv', index_col=0)

In [35]:
df2

   a  b  c
0  1  2  3
1  4  5  6

In [36]:
df2.T

   0  1
a  1  4
b  2  5
c  3  6

In [37]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [38]:
df.describe()

             a        b        c
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [42]:
df['a']

0    1
1    4
Name: a, dtype: int64

In [45]:
df['a'][1]

4

In [50]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [56]:
df.loc[0,]

a    1
b    2
c    3
Name: 0, dtype: int64

In [ ]:
df =